[
    {
        "company": "Unionbank Online",
        "description": "As a Front-End Developer, I played a key role in enhancing the user onboarding process, resulting in a smoother and more efficient experience for users. I accelerated development by creating reusable components, which improved scalability and significantly boosted overall team productivity. By closely aligning UI implementation with Figma designs, I ensured improved usability and a more polished visual experience. I also fostered strong collaboration with cross-functional teams—working closely with Product, UX, and QA—to help drive successful project outcomes. Operating in an Agile environment, I quickly adapted to shifting requirements and consistently delivered high-quality features on time.",
        "tenure": "Sept 2021 - Present",
        "sub_company": "Whitecloak Technologies, Inc.",
        "link": "whitecloak",
        "role": "Frontend Developer",
        "responsibilities": [
            "Enhanced user onboarding, resulting in a smoother and more efficient user experience.",
            "Accelerated development by creating reusable components, boosting scalability and productivity.",
            "Improved UI usability and visual appeal by aligning designs with Figma standards.",
            "Fostered effective cross-functional collaboration, contributing to successful project outcomes.",
            "Drove Agile project success by adapting quickly to changing requirements and delivering on time."
        ]
    },
    {
        "company": "Atmos Cloud Solutions, Inc.",
        "description": "At my previous company, I was responsible for ensuring high-quality graphic standards and maintaining strict brand consistency across all user-facing components. I contributed to the scalability of the front-end codebase by building reusable and maintainable components, which streamlined future development and reduced redundancy. Additionally, I was actively involved in estimating timelines for upcoming project phases, helping the team plan more effectively and meet delivery targets with greater accuracy.",
        "tenure": "Feb 2021 - Aug 2021",
        "sub_company": null,
        "link": "atmos",
        "role": "Frontend Developer",
        "responsibilities": [
            "Ensure high quality graphic standards and brand consistency.",
            "Build reusable code for future use.",
            "Timeline estimation of future project phases."
        ]
    },
    {
        "company": "Libelle Creative Inc.",
        "description": "During my time at this company, I was responsible for converting design prototypes into fully functional and responsive websites, ensuring seamless performance across various devices and screen sizes. I managed the company’s Linux/UNIX-based server environment, handling configuration, maintenance, and deployments. Additionally, I created isolated website environments tailored to client needs, enabling efficient development and testing. My role also included domain management tasks such as DNS configuration, domain registration, and renewal handling, ensuring smooth website accessibility and uptime.",
        "tenure": "2013 - 2021",
        "sub_company": null,
        "link": "libelle",
        "role": "Web Developer",
        "responsibilities": [
            "Convert Prototypes into a running website.",
            "Website responsiveness.",
            "Managing the company's server (Linux/UNIX).",
            "Creating a website environment for clients.",
            "Domain management."
        ]
    }
]